### Terraform CI Summary

**Initialization:** ✅ `success` 
**Validation & Format:** ✅ `success` 
**Plan:** ✅ `success` 

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.random_password.rancher_bootstrap[0]: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.random_password.k3s_token: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1128618][0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101196045][0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer.cluster[0]: Refreshing state... [id=4313702][0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11375703][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2383559][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1128617][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 0s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 1s [id=229419124][0m
[0m[1mmodule.kube-hetzner.local_file.kustomization_backup[0]: Refreshing state... [id=cf86fda18e25705b5f249ca700fb4baec1691c6d][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 0s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11375703-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11375703-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11375703-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11375703-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11375703-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11375703-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file: Refreshing state... [id=3mlb8c8cyt5gsyccw675][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file: Refreshing state... [id=1ba3gjbzhwc8myuqqo6b][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.server: Refreshing state... [id=neu][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.server: Refreshing state... [id=nfz][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file: Refreshing state... [id=hjg3ho30k8dmn3u0aszj][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file: Refreshing state... [id=mmpncwt5n9fzan33vtzi][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.server: Refreshing state... [id=ngz][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file: Refreshing state... [id=pe31fzbm5nva8c6eqjaf][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=1tabbd94xgou5c8e4ovo][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server: Refreshing state... [id=ore][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=ihd][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server: Refreshing state... [id=mdg][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Read complete after 0s [id=4146298938][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Read complete after 0s [id=1522032672][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Read complete after 0s [id=3662031433][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Read complete after 0s [id=2284651667][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Read complete after 0s [id=903132686][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Read complete after 0s [id=1025286683][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107403214][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server: Refreshing state... [id=107403211][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server: Refreshing state... [id=107403210][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server: Refreshing state... [id=107403213][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server: Refreshing state... [id=107403215][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server: Refreshing state... [id=107403212][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram: Refreshing state... [id=8647060091069521428][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries: Refreshing state... [id=4161303364001288845][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram: Refreshing state... [id=4756947962821358876][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram: Refreshing state... [id=5048372947026417589][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries: Refreshing state... [id=7792981522729126798][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries: Refreshing state... [id=4871474074854043927][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107403215-5.75.224.184][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107403213-95.216.160.119][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107403214-188.245.148.8][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server_network.server: Refreshing state... [id=107403214-11375703][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server_network.server: Refreshing state... [id=107403213-11375703][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server_network.server: Refreshing state... [id=107403215-11375703][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107403211-91.98.29.19][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server_network.server: Refreshing state... [id=107403210-11375703][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107403212-65.108.83.235][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107403210-195.201.238.37][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server_network.server: Refreshing state... [id=107403212-11375703][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server_network.server: Refreshing state... [id=107403211-11375703][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries: Refreshing state... [id=645264348985808652][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries: Refreshing state... [id=860293776952254278][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries: Refreshing state... [id=5272982029774373019][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram: Refreshing state... [id=4106391619272758915][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram: Refreshing state... [id=8009042595511987079][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram: Refreshing state... [id=5962920519838457402][0m
[0m[1mmodule.kube-hetzner.null_resource.first_control_plane: Refreshing state... [id=2462086252533300031][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"]: Refreshing state... [id=7156666042968588229][0m
[0m[1maws_route53_record.lb_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_A][0m
[0m[1maws_route53_record.lb_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.rancher_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_A][0m
[0m[1maws_route53_record.api_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.rancher_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.api_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_A][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"]: Refreshing state... [id=536888095153180919][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"]: Refreshing state... [id=7942828420900865057][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"]: Refreshing state... [id=6731328891333359358][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"]: Refreshing state... [id=5412199800371579494][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"]: Refreshing state... [id=8895024537773166159][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"]: Refreshing state... [id=3990382675859027336][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"]: Refreshing state... [id=5497903491868003045][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"]: Refreshing state... [id=6737910200846455806][0m
[0m[1mmodule.kube-hetzner.data.remote_file.kubeconfig: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["1-0-worker-1"]: Refreshing state... [id=4277510312155784035][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["0-0-worker-0"]: Refreshing state... [id=4440375925796107918][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization: Refreshing state... [id=7187242730725047142][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["2-0-worker-2"]: Refreshing state... [id=53575723246061252][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["2-0-worker-2"]: Refreshing state... [id=6376062561321214417][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["0-0-worker-0"]: Refreshing state... [id=4751586662690737078][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["1-0-worker-1"]: Refreshing state... [id=2805586305836782981][0m
[0m[1mmodule.kube-hetzner.data.remote_file.kubeconfig: Read complete after 4s [id=5.75.224.184:22:/etc/rancher/k3s/k3s.yaml][0m
[0m[1mmodule.kube-hetzner.local_sensitive_file.kubeconfig[0]: Refreshing state... [id=751bfc043da8187cbbc56f538962ed0d9ec1024b][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_route53_record.api_ipv4[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_route53_record" "api_ipv4" {
        id                               = "Z00476003F8RX1KPNHHY4_api.baphomet.cloud_A"
        name                             = "api.baphomet.cloud"
      [33m~[0m[0m records                          = [
          [31m-[0m[0m "91.98.13.228",
          [32m+[0m[0m "188.245.148.8",
          [32m+[0m[0m "5.75.224.184",
          [32m+[0m[0m "95.216.160.119",
        ]
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_route53_record.api_ipv6[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_route53_record" "api_ipv6" {
        id                               = "Z00476003F8RX1KPNHHY4_api.baphomet.cloud_AAAA"
        name                             = "api.baphomet.cloud"
      [33m~[0m[0m records                          = [
          [31m-[0m[0m "2a01:4f8:c01e:3ff2::1",
          [32m+[0m[0m "2a01:4f8:c012:c0f1::1",
          [32m+[0m[0m "2a01:4f8:c0c:7460::1",
          [32m+[0m[0m "2a01:4f9:c012:f19::1",
        ]
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_route53_record.lb_ipv4[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_route53_record" "lb_ipv4" {
        id                               = "Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_A"
        name                             = "lb.baphomet.cloud"
      [33m~[0m[0m records                          = [
          [31m-[0m[0m "167.235.105.168",
          [32m+[0m[0m "91.98.13.228",
        ]
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_route53_record.rancher_ipv4[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_route53_record" "rancher_ipv4" {
        id                               = "Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_A"
        name                             = "rancher.baphomet.cloud"
      [33m~[0m[0m records                          = [
          [31m-[0m[0m "167.235.105.168",
          [32m+[0m[0m "91.98.13.228",
        ]
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = <<-EOT
            "apiVersion": "kustomize.config.k8s.io/v1beta1"
            "kind": "Kustomization"
            "patches":
            - "patch": |
                apiVersion: apps/v1
                kind: Deployment
                metadata:
                  name: system-upgrade-controller
                  namespace: system-upgrade
                spec:
                  template:
                    spec:
                      containers:
                        - name: system-upgrade-controller
                          volumeMounts:
                            - name: ca-certificates
                              mountPath: /var/lib/ca-certificates
                      volumes:
                        - name: ca-certificates
                          hostPath:
                            path: /var/lib/ca-certificates
                            type: Directory
              "target":
                "group": "apps"
                "kind": "Deployment"
                "name": "system-upgrade-controller"
                "namespace": "system-upgrade"
                "version": "v1"
            - "path": "kured.yaml"
            - "path": "ccm.yaml"
            "resources":
            - "https://github.com/hetznercloud/hcloud-cloud-controller-manager/releases/download/v1.26.0/ccm-networks.yaml"
            - "https://github.com/kubereboot/kured/releases/download/1.17.1/kured-1.17.1-dockerhub.yaml"
            - "https://github.com/rancher/system-upgrade-controller/releases/download/v0.14.2/system-upgrade-controller.yaml"
            - "https://github.com/rancher/system-upgrade-controller/releases/download/v0.14.2/crd.yaml"
            - "hcloud-csi.yaml"
            - "traefik_ingress.yaml"
            - "longhorn.yaml"
            - "cert_manager.yaml"
            - "rancher.yaml"
        EOT
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "authentication_config" {
      [33m~[0m[0m id       = "7942828420900865057" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709" [33m->[0m[0m "9ab364d56287b5878fe7cb1f8e08dda07651d4dc"
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "authentication_config" {
      [33m~[0m[0m id       = "7156666042968588229" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709" [33m->[0m[0m "9ab364d56287b5878fe7cb1f8e08dda07651d4dc"
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "authentication_config" {
      [33m~[0m[0m id       = "536888095153180919" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709" [33m->[0m[0m "9ab364d56287b5878fe7cb1f8e08dda07651d4dc"
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "control_plane_config" {
      [33m~[0m[0m id       = "8895024537773166159" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "config"           = (sensitive value)
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "control_plane_config" {
      [33m~[0m[0m id       = "6731328891333359358" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "config"           = (sensitive value)
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "control_plane_config" {
      [33m~[0m[0m id       = "5412199800371579494" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "config"           = (sensitive value)
            [90m# (1 unchanged element hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.null_resource.kustomization[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "kustomization" {
      [33m~[0m[0m id       = "7187242730725047142" -> (known after apply)
      [33m~[0m[0m triggers = {
          [33m~[0m[0m "helm_values_yaml" = (sensitive value)
            [90m# (2 unchanged elements hidden)[0m[0m
        }
    }

[1mPlan:[0m 9 to add, 4 to change, 7 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*